Tekla Open API Reference for Tekla Structures 2025
Solid.MaximumPoint Property
 Gets the maximum axis-aligned point of the solid in the current plane.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point MaximumPoint { get; }
Public ReadOnly Property MaximumPoint As Point
	Get
Property Value
Type: Point
Implements
ISolid.MaximumPoint
See Also
Reference
Solid Class
Tekla.Structures.Model Namespace